In [2]:
import pandas as pd

#create DataFrame
df = pd.DataFrame({'store': ['B', 'B', 'A', 'A', 'B', 'B', 'A', 'A'],
                   'sales': [12, 25, 8, 14, 10, 20, 30, 30]})

In [5]:
df.sort_values(['sales', 'store'],ascending=False).groupby('store').head()

  store  sales
6     A     30
7     A     30
1     B     25
5     B     20
3     A     14
0     B     12
4     B     10
2     A      8

In [6]:
df = pd.DataFrame({'store': ['A', 'A', 'A', 'A', 'B', 'B', 'B', 'B'],
                   'quarter': [1, 1, 2, 2, 1, 1, 2, 2],
                   'employee': ['Andy', 'Bob', 'Chad', 'Diane',
                                'Elana', 'Frank', 'George', 'Hank']})

In [7]:
df

  store  quarter employee
0     A        1     Andy
1     A        1      Bob
2     A        2     Chad
3     A        2    Diane
4     B        1    Elana
5     B        1    Frank
6     B        2   George
7     B        2     Hank

In [8]:
#group by store and quarter, then concatenate employee strings
df.groupby(['store', 'quarter'], as_index=False).agg({'employee': ' '.join})

  store  quarter     employee
0     A        1     Andy Bob
1     A        2   Chad Diane
2     B        1  Elana Frank
3     B        2  George Hank

In [11]:
df = pd.DataFrame({'team': ['A', 'A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'B'],
                   'points': [12, 29, 34, 14, 10, 11, 7, 36, 34, 22]})

df

  team  points
0    A      12
1    A      29
2    A      34
3    A      14
4    A      10
5    B      11
6    B       7
7    B      36
8    B      34
9    B      22

In [15]:
#calculate  mean of two largest points values for each team
df.groupby('team')['points'].apply(lambda grp: grp.nlargest(2).mean())

team
A    31.5
B    35.0
Name: points, dtype: float64

In [16]:
df = pd.DataFrame({'team': ['A', 'A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'B'],
                   'position': ['G', 'G', 'G', 'F', 'F', 'G', 'G', 'F', 'F', 'F'],
                   'points': [5, 7, 7, 9, 12, 9, 9, 4, 7, 7],
                   'rebounds': [11, 8, 10, 6, 6, 5, 9, 12, 13, 15]})

#view DataFrame
df

  team position  points  rebounds
0    A        G       5        11
1    A        G       7         8
2    A        G       7        10
3    A        F       9         6
4    A        F      12         6
5    B        G       9         5
6    B        G       9         9
7    B        F       4        12
8    B        F       7        13
9    B        F       7        15

In [18]:
#count number of unique values in 'points' column grouped by 'team' column
df.groupby('team')['rebounds'].nunique()

team
A    4
B    5
Name: rebounds, dtype: int64

In [19]:
#display unique values in 'points' column grouped by 'team'
df.groupby('team')['points'].unique()

team
A    [5, 7, 9, 12]
B        [9, 4, 7]
Name: points, dtype: object

In [23]:
#calculate percentage of total points scored grouped by team
df['team_percent'] = df['points'] / df.groupby('team')['points'].transform('sum')

df

  team position  points  rebounds  team_percent
0    A        G       5        11      0.125000
1    A        G       7         8      0.175000
2    A        G       7        10      0.175000
3    A        F       9         6      0.225000
4    A        F      12         6      0.300000
5    B        G       9         5      0.250000
6    B        G       9         9      0.250000
7    B        F       4        12      0.111111
8    B        F       7        13      0.194444
9    B        F       7        15      0.194444

In [18]:

import pandas as pd

df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar'],

                   'B' : ['one', 'one', 'two', 'three', 'two', 'two'],

                   'C' : [1, 5, 5, 2, 5, 5],

                   'D' : [2.0, 5., 8., 1., 2., 9.]})


grouped = df.groupby(["A", "B"])["D"].unique().mean()

grouped

#grouped.transform(lambda x: (x - x.mean()) / x.std())

array([5. , 3.8])

In [10]:
import pandas as pd

Admissions = { "Courses":["DS", "DE", "DS", "DE", "Cloud"],
                "Fees":[2000, 3000, 1800, 2500, 60000],
                "Duration":["90Days", "60Days", "45Days", "90Days", "30Days"]}

df = pd.DataFrame(Admissions)

df

  Courses   Fees Duration
0      DS   2000   90Days
1      DE   3000   60Days
2      DS   1800   45Days
3      DE   2500   90Days
4   Cloud  60000   30Days

In [30]:
df2 = df.groupby("Courses")["Fees"].sum().sort_values(ascending = False).head()

df2

Courses
Cloud    60000
DE        5500
DS        3800
Name: Fees, dtype: int64

In [15]:
import numpy as np

df3 = df.groupby(["Courses", "Duration"])
df3

In [16]:
df3["Fees"].agg([np.mean, np.median])

                     mean   median
Courses Duration
Cloud   30Days    60000.0  60000.0
DE      60Days     3000.0   3000.0
        90Days     2500.0   2500.0
DS      45Days     1800.0   1800.0
        90Days     2000.0   2000.0

In [19]:
def high_fees(x):
    return x > 20000

df["Fees"].apply(high_fees)

0    False
1    False
2    False
3    False
4     True
Name: Fees, dtype: bool

In [23]:
df["Fees"].apply(lambda x: x + 20000)

0    22000
1    23000
2    21800
3    22500
4    80000
Name: Fees, dtype: int64

In [ ]:
df["Fees"].transform(lambda x: x*x)

In [35]:
df2 = df.groupby(["Courses", "Duration"])

df2
#["Fees"].transform(lambda x: x*x)